welcome_text = (
    "👋 Привет! Добро пожаловать в IP-Tracker\n"
    "🔎 Я помогу тебе получить информацию по номеру телефона или IP-адресу.\n\n"
    "Вот что я умею:\n"
    "📱 Пробить по номеру телефона: оператор, регион, возможные утечки\n"
    "🌐 Пробить по IP-адресу: геолокация, провайдер, подозрительная активность\n\n"
    "❗️ Используй команды:\n"
    "/phone — для пробива по номеру\n"
    "/ip — для пробива по IP\n"
    "/history — история ваших запросов"
)
help_text = (
    "📌 Доступные команды:\n\n"
    "/phone — пробив по номеру телефона\n"
    "/ip — пробив по IP\n"
    "/history — история ваших запросов"
)
phone_start_text = "⚠️ Номер вводите в формате: +71234567890 (без пробелов)"
ip_start_text = "🌐 Введите IP-адрес в формате 192.168.0.1"
invalid_number_text = (
    "❌ Неверный формат номера.\n"
    "Пожалуйста, введи номер в формате: +71234567890 (без пробелов и символов)."
)
invalid_ip_text = (
    "❌ Неверный формат IP-адреса.\n"
    "Пожалуйста, введите корректный IP-адрес, например: 192.168.1.1"
)
github_link_text = "🔗 Репозиторий проекта: https://github.com/finniy/IP-Tracker"
