WELCOME_TEXT = (
    "👋 Привет! Добро пожаловать в IP-Tracker\n"
    "🔎 Я помогу тебе получить информацию по номеру телефона или IP-адресу.\n\n"
    "Вот что я умею:\n"
    "📱 Пробить по номеру телефона: оператор, регион, возможные утечки\n"
    "🌐 Пробить по IP-адресу: геолокация, провайдер, подозрительная активность\n\n"
    "❗️ Используй команды:\n"
    "/phone — для пробива по номеру\n"
    "/ip — для пробива по IP\n"
    "/history — история ваших запросов"
)

HELP_TEXT = (
    "📌 Доступные команды:\n\n"
    "/phone — пробив по номеру телефона\n"
    "/ip — пробив по IP\n"
    "/history — история ваших запросов"
)

PHONE_START_TEXT = "⚠️ Номер вводите в формате: +71234567890 (без пробелов)"
IP_START_TEXT = "🌐 Введите IP-адрес в формате 192.168.0.1"

LOCATION_START_TEXT = "🗺️ Примерное местоположение по IP"

NO_DATA = '❌ Не удалось найти данные'
INVALID_NUMBER_TEXT = (
    "❌ Неверный формат номера.\n"
    "Пожалуйста, введи номер в формате: +71234567890 (без пробелов и символов)."
)

NO_HISTORY_TEXT = "История запросов {} пуста"

INVALID_IP_TEXT = (
    "❌ Неверный формат IP-адреса.\n"
    "Пожалуйста, введите корректный IP-адрес, например: 192.168.1.1"
)

GITHUB_LINK_TEXT = "🔗 Репозиторий проекта: https://github.com/finniy/IP-Tracker"
